#include <stdio.h>
#include <stdlib.h>
#include <string.h>

void test1() {
    char a = 3;
    char b = 127;
    // a 和 b 在计算的时候会整形提升
    // 正数补0 负数补1 无符号类型补0
    // 计算时：
    // a --- 00000000000000000000000000000000011
    // b --- 00000000000000000000000000001111111
    // c --- 00000000000000000000000000010000010
    // 放到c里时，会截断
    // c --- 10000010
    char c = a + b;
    // 打印的时候用的整形打印，所以会整形提升
    // 这个是负数，所以补1
    // c --- 111111111111111111111111111100000010
    // 结果为 -126
    printf("%d\n", c);
}

void test2() {
}

int main() {
    test1();
    test2();

    return 0;
}